; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v13 ?v12)
             (pred_12 ?v2 ?v10)
             (pred_7 ?v13 ?v10)
             (pred_8 ?v9 ?v13 )
	     (pred_10 ?v13)
             (pred_2 ?v7)
             (pred_3 ?v2)
             (pred_11 ?v10)
             (pred_5 ?v13)
             (pred_1 ?v2)
             (pred_6 ?v13)
             (pred_9 ))



(:action op_1
:parameters (?v8 ?v11 ?v3 ?v5)
:precondition (and (pred_2 ?v8) (pred_2 ?v11) (pred_3 ?v3) (pred_11 ?v5)
          (pred_4 ?v8 ?v11) (pred_12 ?v3 ?v5)
                   (pred_7 ?v11 ?v5) (pred_10 ?v8) 
                   (pred_5 ?v11) (pred_1 ?v3))
:effect (and  (pred_6 ?v11) (not (pred_5 ?v11))))


(:action op_4
:parameters (?v8 ?v4)
:precondition (and (pred_2 ?v8) (pred_2 ?v4)
               (pred_10 ?v8) (pred_4 ?v8 ?v4) (pred_6 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v8))))

(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_2 ?v8) (pred_3 ?v3) 
                  (pred_10 ?v8) (pred_8 ?v3 ?v8) (pred_9 ))
:effect (and (pred_1 ?v3)
   (not (pred_8 ?v3 ?v8)) (not (pred_9 ))))


(:action op_2
:parameters (?v8 ?v1 ?v6)
:precondition (and (pred_2 ?v8) (pred_3 ?v1) (pred_3 ?v6)
                  (pred_10 ?v8) (pred_1 ?v6) (pred_8 ?v1 ?v8))
:effect (and (pred_1 ?v1) (pred_8 ?v6 ?v8)
        (not (pred_1 ?v6)) (not (pred_8 ?v1 ?v8))))

(:action op_3
:parameters (?v8 ?v3)
:precondition (and (pred_2 ?v8) (pred_3 ?v3) 
                  (pred_10 ?v8) (pred_1 ?v3))
:effect (and (pred_9 ) (pred_8 ?v3 ?v8) (not (pred_1 ?v3)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_12 obj_19 obj_05 obj_15 obj_16 obj_18 obj_22 obj_13 obj_21 obj_09 obj_11 obj_08 obj_20 obj_07 obj_01
    obj_02 obj_10 obj_14
    obj_04 obj_17 obj_06
    )

    (:init
       (pred_9)

       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_2 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_15)
       (pred_2 obj_16)
       (pred_2 obj_18)
       (pred_2 obj_22)
       (pred_2 obj_13)
       (pred_2 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_11)
       (pred_2 obj_08)
       (pred_2 obj_20)
       (pred_2 obj_07)
       (pred_2 obj_01)
       (pred_11 obj_02)
       (pred_11 obj_10)
       (pred_11 obj_14)
       (pred_3 obj_04)
       (pred_3 obj_17)
       (pred_3 obj_06)

       (pred_4 obj_03 obj_15)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_12 obj_16)
       (pred_4 obj_12 obj_19)
       (pred_4 obj_12 obj_03)
       (pred_4 obj_19 obj_18)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_12)
       (pred_4 obj_05 obj_22)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_15 obj_13)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_03)
       (pred_4 obj_16 obj_21)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_12)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_18 obj_22)
       (pred_4 obj_18 obj_19)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_22 obj_11)
       (pred_4 obj_22 obj_05)
       (pred_4 obj_22 obj_18)
       (pred_4 obj_13 obj_08)
       (pred_4 obj_13 obj_21)
       (pred_4 obj_13 obj_15)
       (pred_4 obj_21 obj_20)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_21 obj_16)
       (pred_4 obj_21 obj_13)
       (pred_4 obj_09 obj_07)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_09 obj_21)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_22)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_13)
       (pred_4 obj_20 obj_07)
       (pred_4 obj_20 obj_21)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_01 obj_07)
       (pred_5 obj_21)
       (pred_5 obj_22)
       (pred_5 obj_09)
       (pred_7  obj_21 obj_02)
       (pred_7  obj_22 obj_10)
       (pred_7  obj_09 obj_14)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_6 obj_19)
       (pred_6 obj_05)
       (pred_6 obj_15)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_13)
       (pred_6 obj_11)
       (pred_6 obj_08)
       (pred_6 obj_20)
       (pred_6 obj_07)
       (pred_6 obj_01)

       (pred_12  obj_04 obj_02)
       (pred_12  obj_17 obj_10)
       (pred_12  obj_06 obj_14)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_06 obj_18)
       (pred_10 obj_19)
    )

    (:goal (and
       (pred_8 obj_06 obj_07)
    ))
(:constraints
  (always (not (pred_10 obj_09)))
)
)

; plan
1. (op_4 obj_19 obj_18)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_18)
   goals met: 0 of 1
2. (op_5 obj_18 obj_06)
   deleted: (pred_8 obj_06 obj_18) (pred_9)
   added: (pred_1 obj_06)
   goals met: 0 of 1
3. (op_4 obj_18 obj_16)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_16)
   goals met: 0 of 1
4. (op_4 obj_16 obj_15)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_15)
   goals met: 0 of 1
5. (op_4 obj_15 obj_13)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_13)
   goals met: 0 of 1
6. (op_4 obj_13 obj_08)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_08)
   goals met: 0 of 1
7. (op_4 obj_08 obj_20)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_20)
   goals met: 0 of 1
8. (op_4 obj_20 obj_07)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_07)
   goals met: 0 of 1
9. (op_3 obj_07 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_9) (pred_8 obj_06 obj_07)
   goals met: 1 of 1
